# https://github.com/Homebrew/homebrew-bundle
# specify a directory to install
cask_args appdir: '/Applications'

tap "nats-io/nats-tools"

brew 'git'
brew 'bash-completion'
brew 'tree'
brew 'wget'
brew 'go'
brew 'python3'
brew 'ffmpeg'
brew 'zsh-syntax-highlighting'
brew 'golangci-lint'
brew 'cloud-sql-proxy'
brew 'buf'
brew 'nats-io/nats-tools/nats'
brew 'jq'

cask 'visual-studio-code'
cask 'docker'
cask 'notion'
cask 'telegram'
cask 'postman'
cask 'postico'
cask 'bitwarden'
cask 'alfred'
cask 'discord'
cask 'zed'
cask 'google-chrome'
cask 'slack'
cask 'iterm2'
cask 'devtoys'
cask 'clearvpn'
cask 'google-cloud-sdk'
cask 'ledger-live'
cask 'lens'
cask 'raycast'
