cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'ethereum/ethereum'
tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/science'
tap 'homebrew/services'
tap 'homebrew/versions'

# Homebrew packages

brew 'curl', args: ['with-openssl', 'with-nghttp2']
brew 'coreutils'
brew 'findutils', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'wget', args: ['with-iri']
brew 'tmux'
brew 'n'

# Install more recent versions of some macOS tools.
brew 'vim', args: ['with-override-system-vi']
brew 'grep', args: ['with-default-names']
brew 'less', args: ['with-pcre']
brew 'openssh'

# Other useful stuff
brew 'ngrep'
brew 'ctags' # For vim Tagbar

# I want to compile stuff too
brew 'automake'
brew 'autoconf'

# ZSH related stuff
brew 'zsh'
brew 'zplug', args: ['with-zsh']
brew 'zsh-completions'

# Install other useful binaries.
brew 'ack'
brew 'git'
brew 'stow'
brew 'tree'
brew 'dark-mode'
brew 'imagemagick', args: ['with-webp']
brew 'jq'
brew 'asciinema'
brew 'hub'
brew 'watchman'
brew 'wifi-password'
brew 'axel'
brew 'youtube-dl'
brew 'fortune'
brew 'mtr'
brew 'tig'
brew 'pv'
brew 'ssh-copy-id'
brew 'unrar'
brew 'livestreamer'
brew 'figlet'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'exiftool'

# Pro
brew 'vault'
brew 'terraform'
# brew 'octave'
brew 'heroku'
brew 'docker-compose'
brew 'typespeed'

# GUI application from Caskroom

cask 'docker'
cask 'goland'
cask 'keybase'
cask 'numi'
cask 'qlprettypatch'
cask 'telegram-desktop'
cask 'electrum'
cask 'google-chrome'
cask 'keycastr'
cask 'opera'
cask 'quicklook-json'
cask 'transmission'
cask 'ethereum-wallet'
cask 'google-cloud-sdk'
cask 'ksdiff'
cask 'qlcolorcode'
cask 'sequel-pro'
cask 'tunnelblick'
cask 'exodus'
cask 'iterm2'
cask 'little-snitch'
cask 'qlimagesize'
cask 'sketch'
cask 'visual-studio-code'
cask 'flux'
cask 'java'
cask 'mist'
cask 'qlmarkdown'
cask 'slack'
